app/views/projects/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."project_id" = $1  [["project_id", 980190962]]
---
<tbody>
<% @project.students.each do |student| %>