app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("name", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "MyString"], ["url", "MyString"], ["created_at", "2023-10-17 16:45:57.769532"], ["updated_at", "2023-10-17 16:45:57.769532"]]

  def update
    if @project.update(project_params)
---
UPDATE "projects" SET "name" = $1, "url" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["name", ""], ["url", ""], ["updated_at", "2023-10-17 18:16:31.091517"], ["id", 980190962]]

  def destroy
    if @project.project_evaluations.exists?
      # Handle the case where project_evaluations exist
      # For example, set a flash message and redirect
      flash[:alert] = "Cannot delete project with existing evaluations."
      redirect_to projects_url
    else
      @project.destroy
---
SELECT 1 AS one FROM "project_evaluations" WHERE "project_evaluations"."project_id" = $1 LIMIT $2  [["project_id", 980190962], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 980190962]]

    def set_project
      @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]