app/controllers/students_controller.rb

    def create
      @student = @project.students.new(student_params)
      if @student.save
---
INSERT INTO "students" ("studentid", "name", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["studentid", "123"], ["name", "New Student"], ["project_id", 980190962], ["created_at", "2023-10-17 18:16:31.206434"], ["updated_at", "2023-10-17 18:16:31.206434"]]

    def set_project
      @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]